# Dotfiles
brew "stow"

# Editor
brew "neovim"

# Terminal tools
brew "git"
brew "ripgrep"
brew "fd"
brew "tree"
brew "wget"

# Java
brew "openjdk@17"
brew "maven"

# Rust
brew "rust"

# JavaScript And TypeScript
brew "node"

# Python
brew "python"

# Terminal
cask "ghostty"

# Tools
cask "maccy"

# Format
brew "shfmt"
brew "stylua"
brew "ruff"
brew "prettier"
